package com.djz.pojo;

/**
 * @author djz
 * @date 2021/3/24 -9:25
 */
public class 对象基本原则 {
    public static void main(String[] args) {

    }

    /**
     * java面向对象的五大基本原则：
     * <p>
     * 1.单一职责原则：一个类，最好只做一件事，只有一个引起它变化。
     * <p>
     * 2.开放封闭原则：对扩展开发，对修改封闭。
     * <p>
     * 3.里氏替换原则：子类必须能够替换其基类。里氏替换原则中说，任何基类可以出现的地方，子类一定可以出现。
     * <p>
     * 4.依赖倒置原则：依赖于抽象接口，不要依赖于具体实现。简单的说就是要求对抽象进行编程，不要对实现进行编程，
     * 这样就降低了客户与实现模块间的耦合。
     * <p>
     * 5.接口隔离原则：使用多个小的专门接口，而不是使用一个大的接口。
     */
    public static void define() {

    }

}
